---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.TotalLoad
source: html/1fe925a7-744c-52cc-956f-7590167d1046.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.TotalLoad Property

The Total Connected Load.

## Syntax (C#)
```csharp
public double TotalLoad { get; }
```